Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select2', val : 2, options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select2', val : 2, options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Список с одиночным необязательным выбором (модификатор mode в значении radio-check)
en: Optional single-choice list (mode modifier with radio-check value)

source: Модификатор mode в значении radio-check, так же как и модификатор mode в значении radio, позволяет выбрать ровно один пункт из выпадающего списка. Принципиальное отличие в том, что в значении radio-check есть возможность оставить список без выбранных пунктов.
en: Use this modifier to create the menu that has one mandatory selected item like in the mandatory single-choice list. The fundamental difference between these two menu types is that the menu block with the mode modifier with the radio-check value has the opportunity to leave the menu without the selected items..

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select3', val : 2, text : '—', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select3', val : 2, text : '—', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Позволяет растягивать кнопку раскрывающегося списка на максимально допустимую ширину.
en: Use to set the maximum available width of the button.

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', width : 'available' }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс наоборот: вы пишете БЭМ-проект, а мы подсказываем' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', width : 'available' }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: всему блоку
en: the whole block

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', disabled : true }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс наоборот: вы пишете БЭМ-проект, а мы подсказываем' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', disabled : true }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: отдельному пункту списка
en: The selected value from the dropdown menu.

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Доклад', disabled : true }, { val : 2, text : 'Мастер-класс наоборот: вы пишете БЭМ-проект, а мы подсказываем' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Report', disabled : true }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', focused : true }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm', focused : true }, name : 'select4', val : 2, text : '—', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Модификатор отвечает за стилевое оформление блока.
en: The modifier gives the block a custom design.

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Допустимые значения: 's', 'm', 'l', 'xl'.
en: Acceptable values: 's', 'm', 'l', 'xl'.

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 's' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 's' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'l' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'l' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'xl' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'xl' }, name : 'select1', val : 2, options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Определяет имя выпадающего списка.
en: Specifies the unique name of the dropdown list.

source: Тип: String, Number, Array (если указан модификатор mode в значении check).
en: Type: String, Number, Array (if mode modifier is set to check).

source: Определяет:
en: Specifies:

source: выбранный пункт списка.
en: The selected value from the dropdown menu.

source: список выбранных пунктов списка, если блоку установлен модификатор mode в значении check, и используется тип поля Array.
en: The set of selected values from the dropdown menu. This case is possible if the block has the mode modifier set to check. The field type is an Array.

source: Определяет значение, которое отображается в кнопке раскрывающегося списка, в случае, если ни один из пунктов выбран. Используется только для кнопки с модификатором type в значении check или в значении radio-check.
en: Specifies the button label if any menu item is not selected. Use for the button when the type modifier is set to check or to radio-check value.

source: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select3', text : 'Обучатор', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio-check', theme : 'islands', size : 'm' }, name : 'select3', text : 'Обучатор', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select1', text : 'Ничего не выбрано', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select1', text : 'Ничего не выбрано', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Определяет массив объектов (пунктов списка) либо групп с опциональным названием.
en: Specifies an array of the menu items or groups with an optional name.

source: Задает набор значений для каждого пункта.
en: Each menu item has its own set of values.

source: Значение, которое будет отправлено на сервер при выборе пункта. Обязательное поле.
en: The value to send to the server if the menu item is selected. The mandatory field.

source: Название пункта в списке.
en: Menu item lable.

source: Текст, отображаемый вместо названия пункта в кнопке раскрывающегося списка. Задается только для списков с возможностью множественного выбора.
en: The text on the button that is shown instead of the selected menu item lable. Use only for a multiple-choice dropdown menu.

source: Неактивное состояние отдельного пункта.
en: The disabled state of the single menu item.

source: Иконка. Формируется блоком icon.
en: The icon created by the icon block.

source: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2], text : 'Подписаться на новости', options : [ { val : 1, text : 'Twitter', checkedText : 'tw', icon : { block : 'icon', mods : { social : 'twitter' } } }, { val : 2, text : 'VKontakte', checkedText : 'vk', icon : { block : 'icon', mods : { social : 'vk' } } } ] }
en: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2], text : 'Subscribe', options : [ { val : 1, text : 'Twitter', checkedText : 'tw', icon : { block : 'icon', mods : { social : 'twitter' } } }, { val : 2, text : 'VKontakte', checkedText : 'vk', icon : { block : 'icon', mods : { social : 'vk' } } } ] }

source: Пункты раскрывающегося списка могут быть организованы в группы:
en: Dropdown menu items could be grouped:

source: Название группы пунктов.
en: The name of the menu items group.

source: Массив пунктов.
en: The array of the menu items.

source: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2, 5], text : 'Программа конференции', options : [ { title : 'Теория', group : [ { val : 1, text : 'Доклад №1' }, { val : 2, text : 'Доклад №2' }, { val : 3, text : 'Доклад №3' }, ] }, { title : 'Практика', group : [ { val : 4, text : 'Мастер-класс №1' }, { val : 5, text : 'Мастер-класс №2' } ] } ] }
en: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2, 5], text : 'A conference agenda', options : [ { title : 'Theory', group : [ { val : 1, text : 'Report #1' }, { val : 2, text : 'Report #2' }, { val : 3, text : 'Report #3' }, ] }, { title : 'Practice', group : [ { val : 4, text : 'Workshop #1' }, { val : 5, text : 'Workshop #2' } ] } ] }

source: Поле optionsMaxHeight
en: FieldoptionsMaxHeight

source: Определяет максимальную высоту раскрывающегося списка. Если все пункты списка не вмещаются, появляется полоса прокрутки.
en: Specifies the maximum height of the dropdown menu. A vertical scrollbar appears automatically if all menu items cannot fit a specified popup height.

source: Если значение не указано, высота раскрывающегося списка по умолчанию будет вычисляться в зависимости от количества пунктов.
en: If a value of the optionsMaxHeight field is not specified, the popup height depends on the total height of all menu items.

source: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2, 5], optionsMaxHeight : 100, text : 'Программа конференции', options : [ { title : 'Теория', group : [ { val : 1, text : 'Доклад №1' }, { val : 2, text : 'Доклад №2' }, { val : 3, text : 'Доклад №3' }, ] }, { title : 'Практика', group : [ { val : 4, text : 'Мастер-класс №1' }, { val : 5, text : 'Мастер-класс №2' } ] } ] }
en: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select5', val : [2, 5], optionsMaxHeight : 100, text : 'A conference agenda', options : [ { title : 'Theory', group : [ { val : 1, text : 'Report #1' }, { val : 2, text : 'Report #2' }, { val : 3, text : 'Report #3' }, ] }, { title : 'Practice', group : [ { val : 4, text : 'Workshop #1' }, { val : 5, text : 'Workshop #2' } ] } ] }

source: Определяет уникальный идентификатор раскрывающегося списка.
en: Specifies the unique identifier of the dropdown list.

source: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select1', id : 'Unique_1', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, name : 'select1', id : 'Unique_1', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Служебный блок. Используется для работы большинства блоков библиотеки bem-components:
en: Use this block as a helper block for implementing the common functionality of many blocks of bem-components library:

source: Используется как составная часть блока menu.
en: Use this block as a part of the menu block.

source: Пункт меню, реализованный блоком link.
en: The menu item implemented by the link block.

source: Значение пункта меню.
en: The value of the menu item.

source: Блок menu-item предоставляет возможность изменять состояние, содержимое и тип пунктов меню. Используется только в составе блока menu.
en: Use the menu-item block to control the size, state and appearance of the menu items. Use this block as a part of the menu block.

source: Допустимое значение: 'link'.
en: Acceptable value:: 'link'.

source: Используется для создания пунктов меню, реализованных с помощью блока link, который помещается в поле content BEMJSON-декларации блока.
en: Use this modifier to create the menu items implemented by the link, block that must be declared in the content field in BEMJSON.

source: Модификатор отвечает за неактивное состояние, при котором блок виден, но недоступен для действий пользователя.
en: The modifier makes the block inactive. The disabled block is visible but not available for user actions.

source: Способ использования: – .
en: Use case: – .

source: Выставляется автоматически при наведении курсором на пункт меню.
en: The modifier is added to the block automatically at the moment when you mouse it over.

source: Тип: Number, String.
en: Type: Number, String.

source: Определяет значение пункта меню.
en: Specifies the value of the menu item.

source: Используется для реализации составного блока, который объединяет всплывающий блок (popup) и вызывающий его управляющий компонент (например, кнопку или ссылку).
en: A composite block that consists of a control component (for example, a button or a link) that triggers a popup.

source: Тип управляющего компонента.
en: The type of the control component.

source: Отображение всплывающего блока на странице.
en: Displaying the popup on a page.

source: Размер управляющего компонента.
en: The size of the control component.

source: Содержимое управляющего компонента.
en: Content of the control component.

source: Содержимое всплывающего окна.
en: Content of the popup.

source: Модификатор switcher
en: Modifierswitcher

source: Допустимые значения: link, button.
en: Acceptable values: link, button.

source: Модификатор switcher отвечает за то, какой блок будет использоваться в качестве управляющего компонента:
en: The switcher modifier specifies the type of the control component:

source: ссылка
en: link

source: кнопка
en: button

source: Ссылка как управляющий компонент (модификатор switcher в значении link)
en: Link as control component (switcher modifier with link value)

source: Используется для представления управляющего компонента блоком link.
en: Use to set the link block as the control component.

source: Нажатие на ссылку вызывает всплывающий блок. Переход по ссылке не осуществляется.
en: Clicking on the link triggers the popup block.

source: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : 'Узнать об акциях на сайте', popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : 'New sales', popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: Кнопка как управляющий компонент (модификатор switcher в значении button)
en: Button as control component (switcher modifier with button value).

source: Используется для представления управляющего компонента блоком button.
en: Use to set the button block as the control component.

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : 'Узнать об акциях на сайте', popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : 'New sales', popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm', disabled : true }, switcher : 'Узнать об акциях на сайте', popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm', disabled : true }, switcher : 'New sales', popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm', disabled : true }, switcher : 'Узнать об акциях на сайте', popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm', disabled : true }, switcher : 'Узнать об акциях на сайте', popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: Модификатор opened
en: Modifieropened

source: Способ использования: JS.
en: Use case: JS.

source: Выставляется блоку автоматически при открытии всплывающего окна.
en: The modifier is applied to the block automatically when the popup opens.

source: Допустимое значение: islands.
en: Acceptable value: islands.

source: Отвечает за стилевое оформление блока и может быть задан:
en: The modifier gives the block a custom design and can be applied to:

source: блоку dropdown в целом
en: the whole dropdown block

source: управляющему элементу, если в поле switcher пробрасывается BEMJSON блока link или button.
en: The control component (if the switcher field contains BEMJSON code of the link or button blocks).

source: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : { block : 'link', mods : { pseudo : true, theme : 'islands', size : 'm' }, content : 'Узнать об акциях на сайте' }, popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : { block : 'link', mods : { pseudo : true, theme : 'islands', size : 'm' }, content : 'New sales' }, popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check', theme : 'islands', size : 'm', }, text : 'Узнать об акциях на сайте' }, popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check', theme : 'islands', size : 'm', }, text : 'New sales' }, popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: Задает размер управляющему элементу.
en: The size of the control component.

source: Модификатор size может быть задан:
en: The size modifier can be applied to:

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check', theme : 'islands', size : 'm' }, text : 'Узнать об акциях на сайте' }, popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check', theme : 'islands', size : 'm' }, text : 'New sales' }, popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: Поле switcher
en: Fieldswitcher

source: Определяет содержимое управляющего компонента.
en: Specifies the content of the control component.

source: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : { block : 'link', mods : { pseudo : true }, content : 'Узнать об акциях на сайте' }, popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : { block : 'link', mods : { pseudo : true }, content : 'New sales' }, popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check' }, text : 'Узнать об акциях на сайте' }, popup : 'Скидка 30% на новую коллекцию. Для активации акции нужно ввести промокод.' }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : { block : 'button', mods : { togglable : 'check' }, text : 'New sales' }, popup : '30% discount for a new collection. Enter a promotional code to start shopping.' }

source: Поле popup
en: Fieldpopup

source: Определяет содержимое всплывающего окна.
en: Specifies the content of the popup.

source: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : 'Узнать об акциях на сайте', popup : 'Скидка 30%' }
en: { block : 'dropdown', mods : { switcher : 'link', theme : 'islands', size : 'm' }, switcher : 'New sales', popup : '30% discount' }

source: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'xl' }, switcher : 'Выпадающий список', popup : { block : 'menu', mods : { theme : 'islands', size : 'xl', select : 'check' }, content : [ { block : 'menu-item', val : 1, content : 'Первый пункт' }, { block : 'menu-item', val : 2, content : 'Второй пункт' } ] } }
en: { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'xl' }, switcher : 'Dropdown list', popup : { block : 'menu', mods : { theme : 'islands', size : 'xl', select : 'check' }, content : [ { block : 'menu-item', val : 1, content : 'First item' }, { block : 'menu-item', val : 2, content : 'Second item' } ] } }

source: Используется как обертка для визуальной группировки других блоков. Группируемые блоки помещаются в поле content BEMJSON-декларации.
en: Use this block as a wrapper block for blocks visual grouping. Blocks that need grouping should be placed in content field of block BEMJSON declaration.

source: Варианты использования
en: Use cases

source: Блок позволяет визуально группировать следующие блоки:
en: The control-group allows a user to group the following blocks:
